<a href="https://colab.research.google.com/github/iamnaveenk/Capstone_project_4-online-retail-customer-segmentation-/blob/main/Assignment_Question_Set1_Python_(3)_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Section 1:

    Attempt all questions of this section
    Answers to be written in the cell after the cell with the question (marked with #ANSWER comment)
    Do not edit any cell marked with # DO NOT EDIT comment at the start

#### Q1. Counting the number of odd and even items in a list
    
    Steps:
    1. Iterate throught the list of numbers given in lon
    2. If the number is odd then increase the value of count_even by one, else increase the value of 
       count_odd by one

 Considering âœˆ If the number is even then increase the value of count_even by one , else increase the value of count_odd by one

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# DO NOT EDIT

lon = [6,26,46,71,0,2,5,6,61,3,2,5,6,7,2,6,7,3,7,9,6,7,2,6,2]
# this is a list of random integers

count_even = 0 # variable to count even numbers
count_odd = 0  # variable to count odd numbers

In [ ]:
# ANSWER
for i in lon:
  if i%2==0:
    count_even+=1
  else:
    count_odd+=1

In [ ]:
# DO NOT EDIT

print("Even numbers count: {}".format(count_even))
print("Odd numbers count: {}".format(count_odd))

Even numbers count: 14
Odd numbers count: 11

#### Q2. Editing items in a list
    
    Steps:
    1. Iterate throught the list of numbers given in lon
    2. If the number is even then increase the value of the next element in the list by one
    3. If the number if odd then don't do anything.
    
    Example
    The first element in the list is 6, so we have to increase the next element i.e 26 by 1.
    The second element should be changed to 26 + 1 = 27.
    In the second iteration the number is 27 (as it is changed now) so no change to be done in the
    list
    Continue with the remaining numbers in the list.
    
    Hint: Use enumerate or range functions to track index and value at the same time

In [ ]:
# ANSWER
for i in range(len(lon)):
  if lon[i]%2==0:
    lon[i+1]+=1
print(lon)

[6, 27, 46, 72, 1, 2, 6, 7, 61, 3, 2, 6, 7, 7, 2, 7, 7, 3, 7, 9, 6, 8, 3, 6, 3]

In [ ]:
# DO NOT EDIT

print(lon == [6,26,46,71,0,2,5,6,61,3,2,5,6,7,2,6,7,3,7,9,6,7,2,6,2])

False

#### Q3.  Writing a function to calculate the distance between two points

    Consider two points on the x-y plane [x0, y0] and [x1, y1]
    The distance between two points is given by the euclidean distance
    
\begin{align*}
distance &= \sqrt{(x1 - x0)^2\! +(y1 - y0)^2\!}
\end{align*}

    Steps:
    1. Edit the function distance written in the next cell
    2. a and b are two lists with x and y coordinates
    3. Example a = [1,1] and b = [2.5,0]
    4. Store the calculated distance in the variable distance

In [ ]:
# ANSWER
import math 
def distance(a, b):
    # write your code here
    distance = math.sqrt( ((b[0]-a[0])**2)+((b[1]-a[1])**2) )
    return distance

In [ ]:
# DO NOT EDIT
print(distance([0,0], [1,1]))

1.4142135623730951

#### Q4 Finding the nearest point to [0,0]

    Steps:
    from the ten points (x,y cordinates are considered as one point), calculate the distances
    for each point from [0, 0]. Print the the points nearest to [0,0]

In [ ]:
# DO NOT EDIT

points = [[0.26124953, 0.65709475],
          [0.13592751, 0.57147712],
          [0.3289748 , 0.12776297],
          [0.80833177, 0.67241004],
          [0.99802025, 0.94917782],
          [0.74073727, 0.18226178],
          [0.38854961, 0.81627411],
          [0.60282049, 0.04726195],
          [0.07190173, 0.6739353 ],
          [0.05232909, 0.78875172]]

In [ ]:
from math import sqrt
nearest_point = points[0]
nearest_distance = sqrt(points[0][0]**2 + points[0][1]**2)

for point in points:
  distance = sqrt(point[0]**2 + point[1]**2)
if distance < nearest_distance:
  nearest_point = point
  nearest_distance = distance

In [ ]:
#ANSWER
print("The nearest point to [0,0] is", nearest_point)

The nearest point to [0,0] is [0.26124953, 0.65709475]

### Section 2 - Pandas:

    Attempt all questions of this section
    Answers to be written in the cell after the cell with the question (marked with #answer comment)
    Do not edit any cell marked with # DO NOT EDIT comment at the start

#### Q1 . Creating a pandas dataframe from dictionary

    Convert the dictionary data into a pandas dataframe df

In [ ]:
# DO NOT EDIT
data = {'class_name': ['A', 'B', 'C', 'A', 'A', 'C', 'B', 'C', 'A', 'B']*3,
        'student_id': [i for i in range(1,31)],
        'marks': [100*np.random.rand() for i in range(1, 31)]}

In [ ]:
# ANSWER
import pandas as pd


# df =

In [ ]:
df = pd.DataFrame(data)
df

   class_name  student_id      marks
0           A           1   4.703257
1           B           2  40.022035
2           C           3  51.546118
3           A           4  34.995822
4           A           5  83.710219
5           C           6  15.224088
6           B           7  47.451347
7           C           8  58.194705
8           A           9  49.225354
9           B          10  72.148317
10          A          11  32.577615
11          B          12  27.534712
12          C          13  30.982914
13          A          14   9.485679
14          A          15  28.826065
15          C          16  64.054738
16          B          17  87.243613
17          C          18  38.503217
18          A          19  65.675824
19          B          20   0.751991
20          A          21  67.454249
21          B          22  42.284945
22          C          23  34.081449
23          A          24  81.884313
24          A          25  17.827182
25          C          26  89.049273
26          B          27  42.721482
27          C          28   0.665225
28          A          29   5.915812
29          B          30  29.710224

#### Q2. Filter all rows in dataframe df where class_name = 'A'

In [ ]:
# ANSWER
filtered_df = df[df['class_name'] == 'A']
print(filtered_df)

   class_name  student_id      marks
0           A           1   4.703257
3           A           4  34.995822
4           A           5  83.710219
8           A           9  49.225354
10          A          11  32.577615
13          A          14   9.485679
14          A          15  28.826065
18          A          19  65.675824
20          A          21  67.454249
23          A          24  81.884313
24          A          25  17.827182
28          A          29   5.915812

#### Q3. Filter all rows in the dataframe df where class_name = 'B' and marks is greater than 50

In [ ]:
# ANSWER
df_class_b = df[(df['class_name'] == 'B') & (df['marks'] > 50)]
print(df_class_b)

   class_name  student_id      marks
9           B          10  72.148317
16          B          17  87.243613

#### Q4. Which student got the highest marks amongst all the students

In [ ]:
# ANSWER
max_marks = df['marks'].max()
student_id = df[df['marks'] == max_marks]['student_id'].values[0]
print("The student with the highest marks is student", student_id)

The student with the highest marks is student 26

#### Q5. Find the highest scoring student in each class

In [ ]:
# ANSWER
class_groups = df.groupby('class_name')
highest_scoring_students = {}
for class_name, group in class_groups:
  highest_marks = group['marks'].max()
  highest_scoring_students[class_name] = group[group['marks'] == highest_marks]['student_id'].values[0]
highest_scoring_students

{'A': 5, 'B': 17, 'C': 26}

In [ ]:
highest_scoring = df.groupby('class_name')['marks'].max()
print("Highest scoring student in each class:", highest_scoring)

Highest scoring student in each class: class_name
A    83.710219
B    87.243613
C    89.049273
Name: marks, dtype: float64

#### Q6. Print the index of rows where marks is less than 30

In [ ]:
# ANSWER

low_marks = df[df['marks'] < 30].index
print("Index of rows with marks less than 30:", low_marks)

Index of rows with marks less than 30: Int64Index([0, 5, 11, 13, 14, 19, 24, 27, 28, 29], dtype='int64')

#### Q7. Create a new column named "marks_squared" It should have all the marks squared

In [ ]:
# ANSWER
df['marks_squared'] = df['marks']**2

#### Q8. Create a new column named "passed". If marks is above 40 the keep the value as True else False

In [ ]:
# ANSWER
df['passed'] = df['marks'] > 40

#### Q9. Create a new column named "passed_int". If passed=True then value is 1 else 0

In [ ]:
# ANSWER
df['passed_int'] = df['passed'].astype(int)

#### Q10. Calculate the average marks for each class. Store this in a DataFrame named 'clas_avg'

In [ ]:
# ANSWER
clas_avg = df.groupby('class_name')['marks'].mean().reset_index()

#### Q11. Rename the column containing average marks as  'avg_marks'

In [ ]:
# ANSWER
clas_avg.rename(columns={'marks': 'avg_marks'}, inplace=True)

#### Q12. Join/Merge the two dataframes 'df' and 'clas_avg' on the common column 'class_name'. The resulting dataframe should be stored in a new dataframe called 'result'

In [ ]:
# ANSWER
result = pd.merge(df, clas_avg, on='class_name')

#### Q13. Create a new column 'diff_from_mean' in the dataframe 'result' . This column should store the difference of the students marks from the average class marks in 'avg_marks'.

In [ ]:
# ANSWER
result['diff_from_mean'] = result['marks'] - result['avg_marks']

#### Q14. Which class has the most number of students with marks greater than 55.

In [ ]:
# ANSWER
most_students_high_marks = result[result['marks'] > 55]['class_name'].value_counts().idxmax()
print("Class with most students with marks greater than 55:", most_students_high_marks)

Class with most students with marks greater than 55: A

#### Q15. Export the results DataFrame to a csv file. Name the csv file as 'python_1.csv'. Do not save indexes in the csv.

In [ ]:
# Answer
result.to_csv('python_1.csv', index=False)

### Thank You.